Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [10]:
import pandas as pd

In [11]:
data = [ 4, 8, 15, 16, 23, 42]

In [12]:
ser = pd.Series( data)

In [13]:
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [14]:
#make list of 10 elements
data1 = ['aniket','mohit','ravi','ranjeet','ramesh','pushpa','nancy','dilip','nisha','muskan']

In [15]:
#make a series 
ser1 = pd.Series(data1)

In [23]:
#print the series
print(ser1)

0     aniket
1      mohit
2       ravi
3    ranjeet
4     ramesh
5     pushpa
6      nancy
7      dilip
8      nisha
9     muskan
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

In [24]:
# Import pandas library
import pandas as pd

# make list of lists
data = [['Alice', 25 , 'Female'], ['Bob', 30 , 'Male'], ['Claire', 27 , 'Female']]

# Create the pandas DataFrame
df = pd.DataFrame(data, columns=['Name', 'Age' , 'Gender'])

# print dataframe.
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

ans -  Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called indexes. Pandas Series is nothing but a column in an excel sheet. Labels need not be unique but must be a hashable type. The object supports both integer and label-based indexing and provides a host of methods for performing operations involving the index.

In [25]:
#make a list 
data4 = [12,34,56,78,99,88,76,54,33,21]

#make a series
ser4 = pd.Series(data4)

#print series
ser4

0    12
1    34
2    56
3    78
4    99
5    88
6    76
7    54
8    33
9    21
dtype: int64

Pandas DataFrame is a two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns

In [26]:
#make a list of dict
data5  = [{'name' : "aniket" ," Age" : 19 , "salary" : 400000},
          {'name' : "mohit" ," Age" : 39 , "salary" : 1500000},
          {'name' : "roit" ," Age" : 43 , "salary" : 900000}]
          
#make dataframe
df5 = pd.DataFrame(data5)

#print dataframe
df5

     name   Age   salary
0  aniket    19   400000
1   mohit    39  1500000
2    roit    43   900000

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

ans - read_csv is used to read csv file

      2 -   head() is used to read first five records of file and also used to read desired number of records by filling number in bracket
      
    3 -   tail() is used to read last five records of file and also used to read desired number of records by filling number in bracket
    
    4 -  shape() is used to returns the no. of rows and columns enclosed in a tuple.
    
    5 -  describe is used to get  Summary of Statistics of DataFrame
    
    6-  dropna() is used to removes all the NaN values in the dataframe.
    
    7 - merge()  is used to arguments passed are the dataframes to be merged along with the column name.
    
    8 - replace() is used to replace the file heading name
    
    9 - sort_values()  is used to sort the dataframes
    
    10 - .loc is label base & .iloc is integer position based methods used for slicing & indexing of data.

In [29]:
#using dataframe of q4 to sort 
df5.sort_values(by = ['salary'] , ascending = True)

     name   Age   salary
0  aniket    19   400000
2    roit    43   900000
1   mohit    39  1500000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

ans - All Pandas (Dataframe , Panel ) data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable.

DataFrame is widely used and one of the most important data structures. Panel is used much less.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [40]:
import pandas as pd
# Create pandas Series
name = pd.Series(["aniket" ,"Mohit" ,"Ravi","Rinku"], name = 'name')
clas = pd.Series([ 12 , 9 , 11 , "BA" ], name = "class")
clasteacher = pd.Series(["ankit " , "sudh" , "arijit " , "ravish "], name = "class teacher")  

# Combine two series.
df=pd.concat([name , clas],axis=1)

# It also supports to combine multiple series.
df=pd.concat([name, clas ,clasteacher],axis=1)
print(df)

     name class class teacher
0  aniket    12        ankit
1   Mohit     9          sudh
2    Ravi    11       arijit
3   Rinku    BA       ravish